Autodesk.Revit.DB.SelectionFilterElement.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new SelectionFilterElement in the given document.
document:
The document in which to create the SelectionFilterElement.
name:
The name for the new SelectionFilterElement.
Returns:
The new SelectionFilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a filter element name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013